read_verilog -sv ../../code/axi/deepcoder:14/AXI4_Lite_Master_code_0_RAGTrue.sv
read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/local/share/qflow/tech/osu035_redm4/osu035_stdcells.lib
setattr -unset keep
proc; check -assert -force-detailed-loop-check -initdrv -noinit
synth -top AXI4_Lite_Master 
dfflibmap -liberty /usr/local/share/qflow/tech/osu035_redm4/osu035_stdcells.lib 
opt
abc -exe /usr/local/share/qflow/bin/yosys-abc -liberty /usr/local/share/qflow/tech/osu035_redm4/osu035_stdcells.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D} 
flatten
setundef -zero 
clean -purge 
iopadmap -outpad BUFX2 A:Y -bits 
opt 
clean 
rename -enumerate 
write_verilog  mapped.v 
stat -liberty /usr/local/share/qflow/tech/osu035_redm4/osu035_stdcells.lib
